Tekla Open API Reference for Tekla Structures 2025
Part.PartAttributes.Representation Property
 The representation of the part.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Part.Representation Representation { get; set; }
Public Property Representation As Part.Representation
	Get
	Set
Property Value
Type: Part.Representation
See Also
Reference
Part.PartAttributes Class
Tekla.Structures.Drawing Namespace